# ChatData

## Sqlite
We are using a file system called **sqlite**. It looks and acts like a real single user relational database (RDB). sqlite3 comes packaged with python. You do not need to install the library. You simply import it (as below).

- We are using Pandas to write and read to sqlite. Pandas will manage a lot of the complexity of dealing with a RDB. There are other ways of reading and writing to a RDB that are VERY common and often used in production systems.  

- The most common other way is to read or write to the RDB row by row. As you can see Pandas puts the entire dataframe into the RDB or extracts a new dataframe from the RDB. These are not row by row operations. These are set operations. Set operations ARE more efficient. However, it is common to use row by row operations to avoid needing large memory computers to hold the dataframes. One row only takes a few bytes. An entire dataframe could be many gigabytes and even petabytes of data. Obviously you will end up with problems with your compute resource if your files are this big. This will not happen to you in this activity and may never happen to you while you are a data analyst. Please just be aware of this. 

- This activity is primarily about querying a RDB, so, we are using a simple way that Pandas provides. If you want to learn the more complex way, just google 'reading and wrting to a relational database using python'. There are many resources to learn from.

- The data types that sqlite supports are quite limited. for example, it does not have a DATE type.  This is not a challenge for this project. However, more sophisticated database systems,such as Postgresql, have a large array of data types, such as "DATE", etc. that give those systems additional capability. 

- All of the SQL queries could also be performed on the Pandas DataFrames directly.  You may want to try this yourself for comparison (but make sure you do the SQL queries first, as this is an exercise in using SQL!).


## SQL Magic
Within the Jupyter notebook we will be using something called **SQL Magic**.  This provides a convenient way to write SQL queries directly into code cells in the notebook and to read the results back into a Pandas DataFrame.  This makes working with SQL much easier!

Note that you may need to update your sqlite version using `conda update -c anaconda sqlite` in order for the SQL Magic to work correctly.

## The Data Analysis Lifecycle
The sections in this notebook follow the stages of the Data Analysis Lifecycle introduced in an earlier activity.  The stages are:

- Acquire
- Transform
- Organise
- Analyse
- Communicate
- Maintain

The requirements document for this project is Template SQL queries.xlsx.

# Preliminary Steps: Create a Database
First let's import Sqlite and the other libraries we will need.

In [1]:
# Import Libraries
import numpy as np
import pandas as pd
import sqlite3

### Create the Database
Now we will create the Sqlite database.  Here is some code that does this for you.  We use the `%load_ext` magic command to load the SQL Magic extension and then use `%sql` to connect to the database.

In [2]:
# If the db does not exist, sqlite will create it.
con = sqlite3.connect('chatdata.db')

# loads sql magic
%load_ext sql 
 
# connects sql magic command to the correct db
%sql sqlite:///chatdata.db

#### Drop the `queries` table if it already exists
The queries table will be our record of the queries created to answer the questions from the requirements spreadsheet.  As we will be running this Jupyter notebook a few times, let's drop (i.e. remove) the queries table so that we start fresh each time.  Here is the code to do this.  We use the `%%sql` magic command to tell Jupyter that we are going to write SQL in the cell.

In [3]:
%%sql
DROP TABLE IF EXISTS 'queries'

 * sqlite:///chatdata.db
Done.

[]

# Task 1: Load the Data
Now we can start loading the data.  The tables will be created as we load the data.  

Note that some of these files are quite large, so make sure you have plenty of free memory!

## Lifecycle Stages: Transform and Organise
The data has already been processed into 3 clean data files ready for this project:

- queries.csv
- posts.csv
- comments.csv

We will load these files into our database.

## Lifecycle Stage: Acquire
The data can be found in the OpenClassrooms instructions for this activity.

### Load Comments Data into a `comments` table
Now we will load the data from the csv files into our sqlite database.

First we load the csv file into a Pandas dataframe:

In [4]:
comments = pd.read_csv('comments.csv')
comments.head()

,Id,PostId,Score,Text,CreationDate,UserId
0,723182,385124,0,@BenBolker I don't understand. The fit cannot ...,2019-01-01 00:06:39,78575
1,723183,385124,3,"You can't add *less* than (`-min(y)`), but you...",2019-01-01 00:09:22,2126
2,723186,385137,0,nice. If you felt like doing the work it would...,2019-01-01 00:32:11,2126
3,723187,385137,0,"i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...",2019-01-01 00:40:36,2126
4,723188,385134,0,"Don't you mean ""so variance should be $\sigma^...",2019-01-01 00:41:28,112141

Now take the comments dataframe and push the data into the Sqlite database table called 'comments':

In [5]:
# load comments into sqlite
comments.to_sql('comments', con, if_exists='replace', index=False)

# read back in to prove that it worked
sql = 'SELECT * FROM comments'
comments = pd.read_sql(sql, con)
comments.head()

,Id,PostId,Score,Text,CreationDate,UserId
0,723182,385124,0,@BenBolker I don't understand. The fit cannot ...,2019-01-01 00:06:39,78575
1,723183,385124,3,"You can't add *less* than (`-min(y)`), but you...",2019-01-01 00:09:22,2126
2,723186,385137,0,nice. If you felt like doing the work it would...,2019-01-01 00:32:11,2126
3,723187,385137,0,"i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...",2019-01-01 00:40:36,2126
4,723188,385134,0,"Don't you mean ""so variance should be $\sigma^...",2019-01-01 00:41:28,112141

### Load Other CSVs
Now that you have seen the code for loading in the comments.csv now do the same to read and write the posts.csv and users.csv to sqlite. 

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter code in the following cells. Insert as many cells as you want to do this.
    </font></div>

In [6]:
# Load posts.csv into Pandas dataframe
posts = pd.read_csv('posts.csv')
posts.head()

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,423497,1,423511,0,2019-08-24 09:39:31,2,68,"<p>From wikipedia <a href=""https://en.wikipedi...",64552,NaN,...,NaN,NaN,2019-08-24 11:38:54,When are biased estimators with lower MSE pref...,<bias><unbiased-estimator><mse>,1,0,1,2019-08-25 10:25:24,NaN
1,423498,1,0,0,2019-08-24 09:47:42,1,24,<p>I am currently doing local sensitivity anal...,87231,NaN,...,NaN,2019-09-06 12:52:32,2019-09-06 12:52:32,How to interpret the result from local sensiti...,<sensitivity-analysis><elasticity>,1,0,0,NaN,NaN
2,423499,1,0,0,2019-08-24 09:48:26,1,56,<p>I'm an honours student in psychology doing ...,257207,NaN,...,NaN,NaN,2019-08-25 08:54:17,Power Analysis in G-Power - Mixed Model Anova,<anova><gpower>,2,0,0,NaN,NaN
3,423500,2,0,215865,2019-08-24 09:57:01,0,0,"<p>Maybe you can look this <a href=""https://me...",106606,NaN,...,NaN,NaN,2019-08-24 09:57:01,NaN,NaN,0,0,0,NaN,NaN
4,423502,2,0,423286,2019-08-24 10:44:52,3,0,<blockquote>\n <p>Q1) Is my approach valid?</...,220643,NaN,...,NaN,2019-08-24 12:13:46,2019-08-24 12:13:46,NaN,NaN,0,1,0,NaN,NaN

In [7]:
# load posts into sqlite
posts.to_sql('posts', con, if_exists='replace', index=False)

# read back in to prove that it worked
sql = 'SELECT * FROM posts'
posts = pd.read_sql(sql, con)
posts.head()

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,423497,1,423511,0,2019-08-24 09:39:31,2,68,"<p>From wikipedia <a href=""https://en.wikipedi...",64552,None,...,None,None,2019-08-24 11:38:54,When are biased estimators with lower MSE pref...,<bias><unbiased-estimator><mse>,1,0,1,2019-08-25 10:25:24,None
1,423498,1,0,0,2019-08-24 09:47:42,1,24,<p>I am currently doing local sensitivity anal...,87231,None,...,None,2019-09-06 12:52:32,2019-09-06 12:52:32,How to interpret the result from local sensiti...,<sensitivity-analysis><elasticity>,1,0,0,None,None
2,423499,1,0,0,2019-08-24 09:48:26,1,56,<p>I'm an honours student in psychology doing ...,257207,None,...,None,None,2019-08-25 08:54:17,Power Analysis in G-Power - Mixed Model Anova,<anova><gpower>,2,0,0,None,None
3,423500,2,0,215865,2019-08-24 09:57:01,0,0,"<p>Maybe you can look this <a href=""https://me...",106606,None,...,None,None,2019-08-24 09:57:01,None,None,0,0,0,None,None
4,423502,2,0,423286,2019-08-24 10:44:52,3,0,<blockquote>\n <p>Q1) Is my approach valid?</...,220643,None,...,None,2019-08-24 12:13:46,2019-08-24 12:13:46,None,None,0,1,0,None,None

In [8]:
# Load users.csv into Pandas dataframe
users = pd.read_csv('users.csv')
users.head()

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,157607,31,2017-04-17 14:50:42,user157607,2019-07-23 16:44:08,NaN,NaN,NaN,0,0,0,https://www.gravatar.com/avatar/2efb161849efa4...,10705183
1,157656,101,2017-04-17 20:08:20,user102859,2019-06-26 13:42:13,NaN,NaN,NaN,3,0,0,https://i.stack.imgur.com/eY4ka.jpg?s=128&g=1,10567606
2,157704,133,2017-04-18 05:10:47,jupiar,2019-11-25 13:32:27,NaN,"Shanghai, China","<p>Originally from the U.K, I have an Undergra...",1,1,0,https://www.gravatar.com/avatar/720e20205122c5...,9501631
3,157709,155,2017-04-18 06:39:18,farmer,2019-02-17 19:44:24,NaN,NaN,NaN,16,0,0,https://www.gravatar.com/avatar/0f8c4bde3d8f25...,10709837
4,157755,101,2017-04-18 12:56:17,Miki P,2019-08-12 17:02:21,NaN,NaN,NaN,1,9,0,https://www.gravatar.com/avatar/af088558cd81c5...,7969290

In [9]:
# load users into sqlite
users.to_sql('users', con, if_exists='replace', index=False)

# read back in to prove that it worked
sql = 'SELECT * FROM users'
users = pd.read_sql(sql, con)
users.head()

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,157607,31,2017-04-17 14:50:42,user157607,2019-07-23 16:44:08,None,None,None,0,0,0,https://www.gravatar.com/avatar/2efb161849efa4...,10705183
1,157656,101,2017-04-17 20:08:20,user102859,2019-06-26 13:42:13,None,None,None,3,0,0,https://i.stack.imgur.com/eY4ka.jpg?s=128&g=1,10567606
2,157704,133,2017-04-18 05:10:47,jupiar,2019-11-25 13:32:27,None,"Shanghai, China","<p>Originally from the U.K, I have an Undergra...",1,1,0,https://www.gravatar.com/avatar/720e20205122c5...,9501631
3,157709,155,2017-04-18 06:39:18,farmer,2019-02-17 19:44:24,None,None,None,16,0,0,https://www.gravatar.com/avatar/0f8c4bde3d8f25...,10709837
4,157755,101,2017-04-18 12:56:17,Miki P,2019-08-12 17:02:21,None,None,None,1,9,0,https://www.gravatar.com/avatar/af088558cd81c5...,7969290

### **TODO**: Drop Duplicates
Look for and drop any duplicates in all 3 of the tables (if they exist). Use Pandas to do this. If you find duplicates, you will need to rewrite the table.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter code in the following cells. 
    </font></div>

In [10]:
# Look for duplicates in the comments table. 
# Setting 'keep' on 'False', all duplicate are 'True' when code is run
comments.duplicated(keep=False)

0        False
1        False
2        False
3        False
4        False
         ...
49995    False
49996    False
49997    False
49998    False
49999    False
Length: 50000, dtype: bool

In [11]:
# Drop duplicates in the comments table
# Setting 'keep' on 'False',drops all duplicate
comments.drop_duplicates(keep=False)

,Id,PostId,Score,Text,CreationDate,UserId
0,723182,385124,0,@BenBolker I don't understand. The fit cannot ...,2019-01-01 00:06:39,78575
1,723183,385124,3,"You can't add *less* than (`-min(y)`), but you...",2019-01-01 00:09:22,2126
2,723186,385137,0,nice. If you felt like doing the work it would...,2019-01-01 00:32:11,2126
3,723187,385137,0,"i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...",2019-01-01 00:40:36,2126
4,723188,385134,0,"Don't you mean ""so variance should be $\sigma^...",2019-01-01 00:41:28,112141
...,...,...,...,...,...,...
49995,791747,424214,1,Agreed. I probably should have done more than ...,2019-08-29 18:59:33,85665
49996,791748,424201,0,Of course cost parameter exists on other ml al...,2019-08-29 19:05:37,35291
49997,791749,203687,0,What's maybe not quite clear from that linked ...,2019-08-29 19:06:35,27340
49998,791752,137072,0,GLMs are fit using iteratively reweighted leas...,2019-08-29 19:25:35,27340
49999,791753,137057,0,GLMs are fit using iteratively reweighted leas...,2019-08-29 19:26:24,27340

**No duplicates were observed in the comments table**

In [12]:
# Look for duplicates in the posts table. 
# Setting 'keep' on 'False', all duplicate are 'True' when code is run
posts.duplicated(keep=False)

0        False
1        False
2        False
3        False
4        False
         ...
42229    False
42230    False
42231    False
42232    False
42233    False
Length: 42234, dtype: bool

In [13]:
# Drop duplicates in the posts table
# Setting 'keep' on 'False',drops all duplicate
posts.drop_duplicates(keep=False)

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,423497,1,423511,0,2019-08-24 09:39:31,2,68,"<p>From wikipedia <a href=""https://en.wikipedi...",64552,None,...,None,None,2019-08-24 11:38:54,When are biased estimators with lower MSE pref...,<bias><unbiased-estimator><mse>,1,0,1,2019-08-25 10:25:24,None
1,423498,1,0,0,2019-08-24 09:47:42,1,24,<p>I am currently doing local sensitivity anal...,87231,None,...,None,2019-09-06 12:52:32,2019-09-06 12:52:32,How to interpret the result from local sensiti...,<sensitivity-analysis><elasticity>,1,0,0,None,None
2,423499,1,0,0,2019-08-24 09:48:26,1,56,<p>I'm an honours student in psychology doing ...,257207,None,...,None,None,2019-08-25 08:54:17,Power Analysis in G-Power - Mixed Model Anova,<anova><gpower>,2,0,0,None,None
3,423500,2,0,215865,2019-08-24 09:57:01,0,0,"<p>Maybe you can look this <a href=""https://me...",106606,None,...,None,None,2019-08-24 09:57:01,None,None,0,0,0,None,None
4,423502,2,0,423286,2019-08-24 10:44:52,3,0,<blockquote>\n <p>Q1) Is my approach valid?</...,220643,None,...,None,2019-08-24 12:13:46,2019-08-24 12:13:46,None,None,0,1,0,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
42229,438739,2,0,270897,2019-12-01 03:52:33,0,0,<p>The purpose of the null is to convert a pro...,140300,None,...,None,None,2019-12-01 03:52:33,None,None,0,0,0,None,None
42230,438740,2,0,61144,2019-12-01 04:26:19,0,0,<p>Related question:</p>\n\n<p>If I have the m...,267322,None,...,None,None,2019-12-01 04:26:19,None,None,0,0,0,None,None
42231,438741,1,0,0,2019-12-01 05:00:39,0,3,<p>I am interested in model selection and wond...,206102,None,...,None,None,2019-12-01 05:00:39,Can I do model selection comparing model compu...,<anova><mixed-model><aic>,0,0,0,None,None
42232,438742,2,0,438698,2019-12-01 05:02:44,0,0,"<p>I would vote for ""deterministic algorithms""...",133755,None,...,None,None,2019-12-01 05:02:44,None,None,0,0,0,None,None
42233,438743,2,0,89809,2019-12-01 05:07:09,0,0,<p>You might as well use scale-invariant clust...,241137,None,...,None,None,2019-12-01 05:07:09,None,None,0,0,0,None,None

**No duplicates were observed in the posts table**

In [14]:
# Look for duplicates in the users table. 
# Setting 'keep' on 'False', all duplicate are 'True' when code is run
users.duplicated(keep=False)

0        False
1        False
2        False
3        False
4        False
         ...
18407    False
18408    False
18409    False
18410    False
18411    False
Length: 18412, dtype: bool

**No duplicates were observed in the users table**

In [15]:
# Drop duplicates in the posts table
# Setting 'keep' on 'False',drops all duplicate
users.drop_duplicates(keep=False)

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,157607,31,2017-04-17 14:50:42,user157607,2019-07-23 16:44:08,None,None,None,0,0,0,https://www.gravatar.com/avatar/2efb161849efa4...,10705183
1,157656,101,2017-04-17 20:08:20,user102859,2019-06-26 13:42:13,None,None,None,3,0,0,https://i.stack.imgur.com/eY4ka.jpg?s=128&g=1,10567606
2,157704,133,2017-04-18 05:10:47,jupiar,2019-11-25 13:32:27,None,"Shanghai, China","<p>Originally from the U.K, I have an Undergra...",1,1,0,https://www.gravatar.com/avatar/720e20205122c5...,9501631
3,157709,155,2017-04-18 06:39:18,farmer,2019-02-17 19:44:24,None,None,None,16,0,0,https://www.gravatar.com/avatar/0f8c4bde3d8f25...,10709837
4,157755,101,2017-04-18 12:56:17,Miki P,2019-08-12 17:02:21,None,None,None,1,9,0,https://www.gravatar.com/avatar/af088558cd81c5...,7969290
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18407,157530,101,2017-04-16 22:44:35,Narfanar,2019-11-29 12:50:02,None,None,None,1,17,0,https://i.stack.imgur.com/QtTmm.png?s=128&g=1,1071965
18408,157574,161,2017-04-17 08:53:48,Jan,2019-07-14 08:46:32,None,None,None,15,1,0,https://www.gravatar.com/avatar/3c2b2c7b445c04...,5145151
18409,157575,461,2017-04-17 08:58:30,Jeremy Voisey,2019-11-22 05:29:36,http://www.jvoisey.com,Cyprus,"<p>I work for a small school, where I maintain...",47,10,0,https://i.stack.imgur.com/zCfd5.jpg?s=128&g=1,10485220
18410,157584,1,2017-04-17 10:48:14,Siyabonga Mbonambi,2019-06-03 08:59:00,None,None,None,1,0,0,https://www.gravatar.com/avatar/cd488b3037badd...,10355063
18411,157592,11,2017-04-17 12:04:35,BloodThirst,2019-08-07 20:58:14,None,None,None,0,0,0,https://www.gravatar.com/avatar/74fe3ffa031ba9...,9762793

## Review the Data

Spend some time reviewing the data.  Understand what data we have, think about how that data can be used to assist in the initiative of understanding how ChatData is used in the real world.  Is the data organised in a way that would lend itself to being manged in a relational database?  How would the different tables be connected?  What are the primary and foreign keys?  Would this give you a 3NF model?

Also think about security and ethics.  Is there personal data in here?  Could individuals be identified through this data?  It it ethical to use the data in this way?  You will be asked to comment on these questions later!

Use the code below to help you.

In [16]:
users.columns

Index(['Id', 'Reputation', 'CreationDate', 'DisplayName', 'LastAccessDate',
       'WebsiteUrl', 'Location', 'AboutMe', 'Views', 'UpVotes', 'DownVotes',
       'ProfileImageUrl', 'AccountId'],
      dtype='object')

In [17]:
users.head()

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,157607,31,2017-04-17 14:50:42,user157607,2019-07-23 16:44:08,None,None,None,0,0,0,https://www.gravatar.com/avatar/2efb161849efa4...,10705183
1,157656,101,2017-04-17 20:08:20,user102859,2019-06-26 13:42:13,None,None,None,3,0,0,https://i.stack.imgur.com/eY4ka.jpg?s=128&g=1,10567606
2,157704,133,2017-04-18 05:10:47,jupiar,2019-11-25 13:32:27,None,"Shanghai, China","<p>Originally from the U.K, I have an Undergra...",1,1,0,https://www.gravatar.com/avatar/720e20205122c5...,9501631
3,157709,155,2017-04-18 06:39:18,farmer,2019-02-17 19:44:24,None,None,None,16,0,0,https://www.gravatar.com/avatar/0f8c4bde3d8f25...,10709837
4,157755,101,2017-04-18 12:56:17,Miki P,2019-08-12 17:02:21,None,None,None,1,9,0,https://www.gravatar.com/avatar/af088558cd81c5...,7969290

In [18]:
comments.columns

Index(['Id', 'PostId', 'Score', 'Text', 'CreationDate', 'UserId'], dtype='object')

In [19]:
comments.head()

,Id,PostId,Score,Text,CreationDate,UserId
0,723182,385124,0,@BenBolker I don't understand. The fit cannot ...,2019-01-01 00:06:39,78575
1,723183,385124,3,"You can't add *less* than (`-min(y)`), but you...",2019-01-01 00:09:22,2126
2,723186,385137,0,nice. If you felt like doing the work it would...,2019-01-01 00:32:11,2126
3,723187,385137,0,"i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...",2019-01-01 00:40:36,2126
4,723188,385134,0,"Don't you mean ""so variance should be $\sigma^...",2019-01-01 00:41:28,112141

In [20]:
posts.columns

Index(['Id', 'PostTypeId', 'AcceptedAnswerId', 'ParentId', 'CreationDate',
       'Score', 'ViewCount', 'Body', 'OwnerUserId', 'OwnerDisplayName',
       'LastEditorUserId', 'LastEditorDisplayName', 'LastEditDate',
       'LastActivityDate', 'Title', 'Tags', 'AnswerCount', 'CommentCount',
       'FavoriteCount', 'ClosedDate', 'CommunityOwnedDate'],
      dtype='object')

In [21]:
posts.head()

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,423497,1,423511,0,2019-08-24 09:39:31,2,68,"<p>From wikipedia <a href=""https://en.wikipedi...",64552,None,...,None,None,2019-08-24 11:38:54,When are biased estimators with lower MSE pref...,<bias><unbiased-estimator><mse>,1,0,1,2019-08-25 10:25:24,None
1,423498,1,0,0,2019-08-24 09:47:42,1,24,<p>I am currently doing local sensitivity anal...,87231,None,...,None,2019-09-06 12:52:32,2019-09-06 12:52:32,How to interpret the result from local sensiti...,<sensitivity-analysis><elasticity>,1,0,0,None,None
2,423499,1,0,0,2019-08-24 09:48:26,1,56,<p>I'm an honours student in psychology doing ...,257207,None,...,None,None,2019-08-25 08:54:17,Power Analysis in G-Power - Mixed Model Anova,<anova><gpower>,2,0,0,None,None
3,423500,2,0,215865,2019-08-24 09:57:01,0,0,"<p>Maybe you can look this <a href=""https://me...",106606,None,...,None,None,2019-08-24 09:57:01,None,None,0,0,0,None,None
4,423502,2,0,423286,2019-08-24 10:44:52,3,0,<blockquote>\n <p>Q1) Is my approach valid?</...,220643,None,...,None,2019-08-24 12:13:46,2019-08-24 12:13:46,None,None,0,1,0,None,None

# Working with Sqlite and SQL Magic
In this section let's spend a little time understanding a bit more about how we can work with Sqlite within Jupyter.

Let's look at 2 ways to query the sqlite database: using SQL Magic or using Pandas.  Either way is fine for this project.

## Writing queries with SQL Magic

You will now need to write some queries to get answers to the questions in the requirements.  

For single-line queries, start the cell with `%sql` and simply enter your query:

In [22]:
# This is an example
%sql SELECT COUNT(*) FROM comments

 * sqlite:///chatdata.db
Done.

[(50000,)]

For multi line sql statements use `%%sql` as follows. This tells Jupyter that *everything* in this cell should be interpreted as sql. So, NO comments other statements are allowed:

In [23]:
%%sql
SELECT Id, PostId, Score, Text
    FROM comments
        LIMIT 5

 * sqlite:///chatdata.db
Done.

[(723182, 385124, 0, '@BenBolker I don\'t understand. The fit cannot be done for the negative $y$. So intuitively I\'d think that in order to retain the relativity of the  ... (24 characters truncated) ... rror" or "flip" it to the positive axis? Would it be possible to adjust every point individually? Basically e.g. take $abs(y_i)$ instead of minimums.'),
 (723183, 385124, 3, "You can't add *less* than (`-min(y)`), but you could add *more*. I'm going to stop answering now sorry, because **judging what the 'best' approach is ... (60 characters truncated) ...  of the analysis, why you need to fit an exponential, your level of computational and statistical sophistication and that of your audience, etc. ...)"),
 (723186, 385137, 0, 'nice. If you felt like doing the work it would be nice to generate an image/contour plot of log-likelihood as a function of (mu, theta) and show the lines corresponding to the two `size` values .'),
 (723187, 385137, 0, 'i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,size=size,log=TRUE)),\n                 xlim=c(2,5),ylim=c(0.2,0.5),\n                 varnames=c("mu","s ... (57 characters truncated) ... ,col="red")\nabline(h=fit.what$theta,col="blue")\n` ... although doesn\'t look this is actually the answer - mu-hat is independent of theta-hat ... ?'),
 (723188, 385134, 0, 'Don\'t you mean "so variance should be $\\sigma^2/(n\\mu^2)$"')]

## Writing queries with Pandas
Another way to write queries is to use pandas:

In [24]:
sql = """
SELECT Id, PostId, Score, Text
    FROM comments
        LIMIT 5
        """
result = pd.read_sql(sql, con)
result

       Id  PostId  Score                                               Text
0  723182  385124      0  @BenBolker I don't understand. The fit cannot ...
1  723183  385124      3  You can't add *less* than (`-min(y)`), but you...
2  723186  385137      0  nice. If you felt like doing the work it would...
3  723187  385137      0  i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...
4  723188  385134      0  Don't you mean "so variance should be $\sigma^...

# Creating Tables with Referential Integrity

When we loaded the csv files into Sqlite database tables, Sqlite created the tables for us behind the scenes. Let's inspect this a bit more.

We can see how Sqlite created the tables by querying the `sqlite_master` table, which Sqlite uses to keep track of what objects have been created in the database:

In [25]:
%%sql 
select sql from sqlite_master

 * sqlite:///chatdata.db
Done.

[('CREATE TABLE "comments" (\n"Id" INTEGER,\n  "PostId" INTEGER,\n  "Score" INTEGER,\n  "Text" TEXT,\n  "CreationDate" TEXT,\n  "UserId" INTEGER\n)',),
 ('CREATE TABLE "posts" (\n"Id" INTEGER,\n  "PostTypeId" INTEGER,\n  "AcceptedAnswerId" INTEGER,\n  "ParentId" INTEGER,\n  "CreationDate" TEXT,\n  "Scor ... (240 characters truncated) ...   "Tags" TEXT,\n  "AnswerCount" INTEGER,\n  "CommentCount" INTEGER,\n  "FavoriteCount" INTEGER,\n  "ClosedDate" TEXT,\n  "CommunityOwnedDate" TEXT\n)',),
 ('CREATE TABLE "users" (\n"Id" INTEGER,\n  "Reputation" INTEGER,\n  "CreationDate" TEXT,\n  "DisplayName" TEXT,\n  "LastAccessDate" TEXT,\n  "WebsiteUr ... (17 characters truncated) ... tion" TEXT,\n  "AboutMe" TEXT,\n  "Views" INTEGER,\n  "UpVotes" INTEGER,\n  "DownVotes" INTEGER,\n  "ProfileImageUrl" TEXT,\n  "AccountId" INTEGER\n)',)]

The above results show the `CREATE TABLE` statements that could be used by Sqlite to recreate the tables with the exact same structure.

The problem with the CREATE TABLE statements above is that they don't enforce **referential integrity**.  In other words, they don't ensure that every UserId and PostId in the comments table refers to an actual UserId and PostId in the users and posts tables.  At the moment. we can insert any old number here, and even have multiple users with the same Id!  One of the advantages of working with relational databases is that they can enforce the correct uniqueness and relationships in the data, but at the moment we are not using that feature.  So let's fix that...

First, let's drop the original tables:

In [26]:
%%sql
DROP TABLE comments;
DROP TABLE users;
DROP TABLE posts;

 * sqlite:///chatdata.db
Done.
Done.
Done.

[]

Prove that this worked by selecting the names of the tables back.  We should have no tables:

In [27]:
%%sql
SELECT name FROM sqlite_master WHERE type='table'
    ORDER BY name

 * sqlite:///chatdata.db
Done.

[]

In Sqlite we need to enable the enforcement of foreign key constraints:

In [28]:
%%sql
PRAGMA foreign_keys=ON;

 * sqlite:///chatdata.db
Done.

[]

Now recreate the users table with a **primary key constraint** by copying the CREATE TABLE statement from above and adding the NOT NULL PRIMARY KEY clause to the Id:

In [29]:
%%sql
CREATE TABLE "users" (
"Id" INTEGER NOT NULL PRIMARY KEY,
"Reputation" INTEGER,
"CreationDate" TEXT,
"DisplayName" TEXT,
"LastAccessDate" TEXT,
"WebsiteUrl" TEXT,
"Location" TEXT,
"AboutMe" TEXT,
"Views" INTEGER,
"UpVotes" INTEGER,
"DownVotes" INTEGER,
"ProfileImageUrl" TEXT,
"AccountId" INTEGER
);

 * sqlite:///chatdata.db
Done.

[]

Now do the same for the posts table:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [30]:
# Run the CREATE TABLE statement for the posts table, including the primary key constraint
%%sql
CREATE TABLE "posts" (
"Id" INTEGER NOT NULL PRIMARY KEY,
"PostTypeId" INTEGER,
"AcceptedAnswerId" INTEGER,
"ParentId" INTEGER,
"CreationDate" TEXT,
"Score" INTEGER,
"ViewCount" INTEGER,
"Body" TEXT,
"OwnerUserId" INTEGER,
"OwnerDisplayName" TEXT,
"LastEditorUserId" INTEGER,
"LastEditorDisplayName" TEXT,
"LastEditDate" TEXT,
"LastActivityDate" TEXT,
"Title" TEXT,
"Tags" TEXT,
"AnswerCount" INTEGER,
"CommentCount" INTEGER,
"FavoriteCount" INTEGER,
"ClosedDate" TEXT,
"CommunityOwnedDate" TEXT
);

SyntaxError: invalid syntax (556184758.py, line 3)

Now for the comments table.  We need to add the primary key constraint on the id here as we did for users and posts, but we also need to add FOREIGN KEY constraints on the UserId and PostId. Read the documentation here and find our how to do that: https://www.sqlite.org/foreignkeys.html.  Then create the comments table with the correct constraints:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [34]:
# Run the CREATE TABLE statement for the comments table, including the primary key constraint and the 2 foreign key constraints
%%sql
CREATE TABLE "comments" (
"Id" INTEGER NOT NULL PRIMARY KEY,
"PostId" INTEGER,
"Score" INTEGER,
"Text" TEXT,
"CreationDate" TEXT,
"UserId" INTEGER
FOREIGN KEY (PostId) REFERENCES posts(Id)
FOREIGN KEY (UserId) REFERENCES users(Id)
);

SyntaxError: invalid syntax (4210291360.py, line 3)

Now we can re-insert the data into these constrained tables.  First users:

In [33]:
# Insert data into the new users table
users.to_sql('users', con, if_exists='append', index=False)

18412

Now posts:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [31]:
# Insert data into the new posts table
posts.to_sql('posts', con, if_exists='append', index=False)

42234

Finally comments, which references the users and posts tables:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [32]:
# Insert data into the new comments table
comments.to_sql('comments', con, if_exists='append', index=False)

50000

Now check that we have the 3 new table definitions in Sqlite:

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table'
    ORDER BY name

We now have all the data in tables in Sqlite and the tables will enforce the referential integrity.

# Example Query and Pattern for Tasks 2 and 3

As you work through the next tasks, you will need to:

1. Prepare the Sqlite query to answer the question
2. Test it
3. Insert it into the `queries` table, so we have a record of it for others.

This is the process that we want you to follow for this project while completing it.

Let's see an example of this by answering the following question:

**Which 5 users have viewed the most times and what is the sum of those views per user?**

## Prepare the Sqlite query

First, let's write the query:

In [ ]:
sql = """
SELECT Id, SUM(Views) AS TotalViews
    FROM Users
        GROUP BY Id
            ORDER BY TotalViews DESC
                LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

## Test the query
You can optionally prove the query worked by performing the same query in Pandas:

In [ ]:
results = users.groupby(['Id']).sum().sort_values('Views', ascending = False)[:5]
results['Views']

## Insert the query into the `queries` table
Now we need to put this query into the `queries` table in sqlite. Remember we want these queries to be accessible to everybody that should have access to them. We do not want people writing and rewriting the same queires over and over again. The easiest thing to do is create a dictionary with the values and insert these into the queries table.  Note that the values are provided as lists as we are inserting a list of values (i.e. a number of rows) into the table.  In this case the number of rows is 1, so we have lists of 1 item.

So here, we have a column called 'task' with a list of values, a column called 'action' with a list of values, etc.

In [37]:
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['Which 5 users have viewed the most times and what is the sum of those views per user?'],
              'query': [sql]
             }
query_dict

{'task': ['Single Table Queries'],
 'action': ['Which 5 users have viewed the most times and what is the sum of those views per user?'],
 'query': ['\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    ']}

Now that you have the data structure (query_dict) containing the data, create a pandas dataframe that holds those values:

In [38]:
queries = pd.DataFrame(query_dict)
queries

,task,action,query
0,Single Table Queries,Which 5 users have viewed the most times and w...,"\n CREATE TABLE ""comments"" (\n ""Id"" INTE..."

Now load that pandas dataframe (queries) into the sqlite table called queries. In this case, you use append NOT replace. You will be adding to this tables as you go thru this project.

In [39]:
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

# read back in to prove that it worked
sql = 'SELECT * FROM queries'
queries = pd.read_sql(sql, con)
queries.head()

,task,action,query
0,Single Table Queries,Which 5 users have viewed the most times and w...,"\n CREATE TABLE ""comments"" (\n ""Id"" INTE..."

It is likely that as you iterate thru this notebook you will create some duplicate entries in the query table. Not a big deal. Just tell sql or pandas (much easier in pandas) to drop the duplicates! If you drop the duplicates in Pandas you will have to write the entire dataframe back to sqlite. Otherwise it is changed in memory in Pandas but NOT in sqlite on the disk drive (or SDD). Just do this drop at the end of this notebook so that you are not constantly dealing with this.

So, to summarise, as you go through the following tasks you need to:

- answer the question in sql
- prove it in pandas (if you want to)
- put the query into the queries table

# Task 1 (continued): Insert the CREATE TABLE Statements into the `queries` Table

Now that we understand how to populate the `queries` table, let's insert the CREATE TABLE statements into it.  First let's define a function to help us insert into the queries table:

In [107]:
# Define a function that will insert into the queries table
def store_query(task, action, query):
    query_dict = {
                  'task': [task],
                  'action': [action],
                  'query': [query]
                 }

    # put query into the query_dict
    queries = pd.DataFrame(query_dict)

    # load query into sqlite
    queries.to_sql('queries', con, if_exists='append', index=False)

Now we can specify the queries and call the above function to store them.  The first one is done for you.

In [41]:
sql = """
    CREATE TABLE "comments" (
    "Id" INTEGER,
    "PostId" INTEGER,
    "Score" INTEGER,
    "Text" TEXT,
    "CreationDate" TEXT,
    "UserId" INTEGER
    )
    """
store_query("Task 1", "Create table comments", sql)

Let's prove it works by selecting back from the queries table:

In [42]:
# Prove it works
%sql SELECT * FROM queries
# queries = pd.read_sql(sql, con)
# queries.head()

 * sqlite:///chatdata.db
Done.

[('Single Table Queries', 'Which 5 users have viewed the most times and what is the sum of those views per user?', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    '),
 ('Task 1', 'Create table comments', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    ')]

## Insert the other CREATE TABLE statements into the `queries` table.
Follow the above pattern to complete these code cells:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cells
    </font></div>

In [ ]:
# Insert the CREATE TABLE for posts into the queries table
sql = """
    CREATE TABLE "posts" (
    "Id" INTEGER,
    "PostTypeId" INTEGER,
    "AcceptedAnswerId" INTEGER,
    "ParentId" INTEGER,
    "CreationDate" TEXT,
    "Score" INTEGER,
    "ViewCount" INTEGER,
    "Body" TEXT,
    "OwnerUserId" INTEGER,
    "OwnerDisplayName" TEXT,
    "LastEditorUserId" INTEGER,
    "LastEditorDisplayName" TEXT,
    "LastEditDate" TEXT,
    "LastActivityDate" TEXT,
    "Title" TEXT,
    "Tags" TEXT,
    "AnswerCount" INTEGER,
    "CommentCount" INTEGER,
    "FavoriteCount" INTEGER,
    "ClosedDate" TEXT,
    "CommunityOwnedDate" TEXT
    )
    """
store_query("Task 1", "Create table posts", sql)

In [ ]:
# Insert the CREATE TABLE for users into the queries table
sql = """
  CREATE TABLE "users" (
    "Id" INTEGER,
    "Reputation" INTEGER,
    "CreationDate" TEXT,
    "DisplayName" TEXT,
    "LastAccessDate" TEXT,
    "WebsiteUrl" TEXT,
    "Location" TEXT,
    "AboutMe" TEXT,
    "Views" INTEGER,
    "UpVotes" INTEGER,
    "DownVotes" INTEGER,
    "ProfileImageUrl" TEXT,
    "AccountId" INTEGER
    ) 
    """
store_query("Task 1", "Create table users", sql)

## Count the Number of Rows in Each Table
Run some queries to count the number of rows in each of the tables.  Don't forget to insert the query into the queries table.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cells
    </font></div>

In [43]:
# Count the number of rows in the comments table
sql = """
SELECT COUNT(*) AS count
    FROM comments
       """ 
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0  50000

In [44]:
# create a dictionary with the values and insert these into the queries table
query_dict = {
              'task': ['Task 1'],
              'action': ['Count the number of rows in the comments table'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [45]:
# Count the number of rows in the users table
sql = """
SELECT COUNT(*) AS count
    FROM users
       """ 
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0  18412

In [46]:
# create a dictionary with the values and insert these into the queries table
query_dict = {
              'task': ['Task 1'],
              'action': ['Count the number of rows in the users table'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [47]:
# Count the number of rows in the posts table
sql = """
SELECT COUNT(*) AS count
    FROM posts
       """ 
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0  42234

In [48]:
# create a dictionary with the values and insert these into the queries table
query_dict = {
              'task': ['Task 1'],
              'action': ['Count the number of rows in the posts table'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

## Do some Random Checks on the Data
Let's write some queries that select 5 random rows from each table.  The queries are provided here:

    select * from Comments order by random() limit 5;
    select * from Users order by random() limit 5;
    select * from Posts order by random() limit 5;

Enter the queries into the code cells below and insert the queries into the `queries` table in the same was as you did for the CREATE TABLE statements.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cells
    </font></div>

In [49]:
# Run the query to select 5 random rows from the comments table
sql = """
SELECT *
    FROM comments
        ORDER BY random()
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

,Id,PostId,Score,Text,CreationDate,UserId
0,730585,388892,0,It could change everything.,2019-01-24 17:24:52,686
1,730974,389144,0,"I'm marking this as answered, although similar...",2019-01-25 17:10:31,87362
2,773137,414200,1,"To get a P-value you need a null distribution,...",2019-06-22 07:02:45,85665
3,749714,400431,0,Can you support your statement that correlatio...,2019-03-31 16:59:03,242429
4,787866,422289,0,"Thank you, that's really helpful. I think I'll...",2019-08-14 13:28:20,0

In [50]:
# create a dictionary with the values and insert these into the queries table
query_dict = {
              'task': ['Task 1'],
              'action': ['Select 5 random rows from the comments table'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [51]:
# Run the query to select 5 random rows from the posts comments
sql = """
SELECT *
    FROM posts
        ORDER BY random()
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,396162,1,396202,0,2019-03-07 14:56:55,0,57,<p>I started to go through this interesting st...,207721,None,...,None,None,2019-03-07 18:04:28,Interpreting the latent growth model output,<self-study><sem><latent-variable>,1,0,0,None,None
1,436497,2,0,436327,2019-11-17 14:34:55,2,0,<p>Your confusion might stem from the fact tha...,264842,None,...,None,None,2019-11-17 14:34:55,None,None,0,2,0,None,None
2,406532,2,0,406252,2019-05-04 08:07:44,1,0,<p>The whole purpose of the <strong>sample spa...,173082,None,...,None,None,2019-05-04 08:07:44,None,None,0,0,0,None,None
3,434978,2,0,434371,2019-11-07 08:04:58,0,0,<p>Assuming the p-value you have is based on a...,1934,None,...,None,None,2019-11-07 08:04:58,None,None,0,0,0,None,None
4,412491,1,0,0,2019-06-11 14:10:53,0,14,<p><strong>BACKGROUND</strong></p>\n\n<p>Imagi...,167434,None,...,None,None,2019-06-11 14:10:53,"In the fully supervised case, provided we have...",<machine-learning><probability><bayesian><infe...,0,0,0,None,None

In [52]:
# create a dictionary with the values and insert these into the queries table
query_dict = {
              'task': ['Task 1'],
              'action': ['Select 5 random rows from the posts table'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [53]:
# Run the query to select 5 random rows from the users table
sql = """
SELECT *
    FROM users
        ORDER BY random()
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,258384,101,2019-09-08 16:28:09,Ian Belcher,2019-10-25 22:13:30,https://ianbelcher.me,"San Francisco, CA, United States","<p>Find me elsewhere at:\n<a href=""https://ian...",0,1,0,https://i.stack.imgur.com/SDjJm.jpg?s=128&g=1,956381
1,265242,1,2019-11-10 10:03:17,ire,2019-11-30 11:36:38,None,None,None,0,0,0,https://www.gravatar.com/avatar/dce3ec9eaac7a2...,10323669
2,224694,101,2018-10-25 01:09:09,3yanlis1bos,2019-11-23 04:57:30,http://igdireuler.blogspot.com.tr,"Selangor, Malaysia",<p>Java dev. <br/>\nCurrently struggling with ...,0,7,0,https://www.gravatar.com/avatar/7f175d4300cfc7...,406692
3,255704,3,2019-08-06 12:57:24,EleMan,2019-10-05 03:50:57,None,Indonesia,None,0,0,0,https://lh6.googleusercontent.com/-MfZonwH4Tqg...,16289539
4,196775,11,2018-02-26 16:44:40,Michael Kuehn,2019-11-30 04:28:48,None,None,<p>Dedicated professional looking to utilize u...,0,0,0,https://lh5.googleusercontent.com/-IXTDkmO8pmc...,8107924

In [54]:
# create a dictionary with the values and insert these into the queries table
query_dict = {
              'task': ['Task 1'],
              'action': ['Select 5 random rows from the users table'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

# Task 2: Create Single Table Queries

## Lifecycle Stage: Analyze
We can now start the analysis with our single-table queries.  First we need to create a new computed column to help with one of the queries.  The code below creates a column called LEN_BODY which is the length of the BODY text:

In [55]:
%%sql
ALTER TABLE POSTS ADD COLUMN LEN_BODY INT

 * sqlite:///chatdata.db
Done.

[]

In [56]:
%%sql
UPDATE POSTS SET LEN_BODY = LENGTH(BODY)

 * sqlite:///chatdata.db
42234 rows affected.

[]

### Single Table Queries
From the Template SQL Queries there are a series of queries requested. You are responsible for coding the result. Use the pattern above to accomplish the coding objective.  Copy and paste the question (column B Action) into a markdown cell and answer the query. Use the pattern that you have been using above. 

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter your code below.  Just keep on inserting cells as you need them.
    </font></div>

In [57]:
# How many posts have 0 comments?
sql = """
SELECT COUNT(*) AS count
    FROM posts
        WHERE CommentCount = 0
            """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0  21713

In [58]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['How many posts have 0 comments?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [59]:
# How many posts have 1 comments?
sql = """
SELECT COUNT(*) AS count
    FROM posts
        WHERE CommentCount = 1
            """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0   6460

In [60]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['How many posts have 1 comments?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [61]:
# How many posts have 2 comments or more?
sql = """
SELECT COUNT(*) AS count
    FROM posts
        WHERE CommentCount >= 2
            """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0  14061

In [62]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['How many posts have 2 comments or more?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [64]:
# Find the 5 posts with the highest viewcount
sql = """
SELECT ViewCount, Id
    FROM posts
        ORDER BY ViewCount DESC
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   ViewCount      Id
0      19542  388566
1      16317  394118
2      11723  431370
3       9850  398646
4       6718  434128

In [65]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['Find the 5 posts with the highest viewcount'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [66]:
# Find the top 5 posts with the highest scores
sql = """
SELECT Score, Id
    FROM posts
        ORDER BY Score DESC
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   Score      Id
0    101  431397
1    100  394128
2     93  426878
3     80  388578
4     77  431370

In [67]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['Find the top 5 posts with the highest scores'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [68]:
# What are the 5 most frequent scores on posts?
sql = """
SELECT score, COUNT (*) AS count
    FROM posts
        GROUP BY Score 
            ORDER BY count DESC
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   Score  count
0      0  19888
1      1  11867
2      2   5094
3      3   2228
4      4   1059

In [69]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['What are the 5 most frequent scores on posts?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [70]:
# How many posts have the keyword "data" in their tags?
sql = """
SELECT COUNT(*) AS count
    FROM posts
        WHERE Tags LIKE "%<data>%"
            """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0      0

In [71]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['How many posts have the keyword "data" in their tags?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [72]:
# What are the 5 most frequent commentcount for posts?
sql = """
SELECT CommentCount, COUNT (*) AS count
    FROM posts
        GROUP BY CommentCount 
            ORDER BY count DESC
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   CommentCount  count
0             0  21713
1             1   6460
2             2   4966
3             3   3063
4             4   2026

In [73]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['What are the 5 most frequent commentcount for posts?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [74]:
# How many posts have an accepted answer?
sql = """
SELECT COUNT(*) AS count
    FROM posts
        WHERE AcceptedAnswerId IS NOT NULL
            """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0  42234

In [75]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['How many posts have an accepted answer?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [76]:
# What is the average reputation of table users?
sql = """
SELECT AVG(Reputation) AS avg_reputation
    FROM users
        """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   avg_reputation
0      312.350912

In [77]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['What is the average reputation of table users?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [78]:
# What are the min and max reputation of users?
sql = """
SELECT MIN(reputation) AS min_rep, MAX(reputation) AS max_rep
    FROM users
        """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   min_rep  max_rep
0        1   228662

In [79]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['What are the min and max reputation of users?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [80]:
# What is the length of the body of 5 most viewed posts?
sql = """
SELECT LENGTH(Body) AS body_length, Id
    FROM posts
        ORDER BY ViewCount DESC
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   body_length      Id
0         2270  388566
1          512  394118
2          811  431370
3         2148  398646
4         1172  434128

In [81]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['What is the length of the body of 5 most viewed posts?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [82]:
# How many different locations are there in the users table?
sql = """
SELECT COUNT(DISTINCT Location) AS count
    FROM users
        """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0   1900

In [83]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['How many different locations are there in the users table?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [85]:
# What are the top 5 locations of users?
sql = """
SELECT Location, COUNT (*) AS count
    FROM users
        WHERE Location <> "None"
        GROUP BY Location 
            ORDER BY count DESC
            LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

                 Location  count
0                 Germany    117
1                   India    100
2           United States     69
3           Paris, France     66
4  London, United Kingdom     63

In [86]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['What are the top 5 locations of users?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

In [87]:
# Rank the days of the week from highest to lowest in terms of the volume of ViewCount as a percentage.
sql = """
SELECT 

CASE CAST(strftime('%w', CreationDate) AS INTEGER)
WHEN 0 THEN 'Sunday'
WHEN 1 THEN 'Monday'
WHEN 2 THEN 'Tuesday'
WHEN 3 THEN 'Wednesday'
WHEN 4 THEN 'Thursday'
WHEN 5 THEN 'Friday'
WHEN 6 THEN 'Saturday'
END AS day_of_week,
        SUM(ViewCount) * 100.0 / (SELECT SUM(ViewCount) FROM posts) AS viewcount_percentage
    FROM posts
        GROUP BY day_of_week
            ORDER BY viewcount_percentage DESC
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

  day_of_week  viewcount_percentage
0    Thursday             16.819476
1   Wednesday             16.768689
2     Tuesday             16.255034
3      Monday             15.806727
4      Friday             13.563061
5      Sunday             11.895609
6    Saturday              8.891404

In [88]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['Rank the days of the week from highest to lowest in terms of the volume of ViewCount as a percentage'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

**NOTE: For the above query** 

This query used the **'strftime'** function with the **%w** format specifier to extract the day of the week from the **CreationDate** column as an integer value **(0 for Sunday, 1 for Monday, etc.)**. The **'CAST'** function is used to convert the result to an integer.

The **'SUM'** function is used to calculate the total ViewCount for each day of the week, and the percentage of the total **'ViewCount'** is calculated using a subquery to get the total **'ViewCount'** for all records in the **'posts'** table. The **'ORDER BY'** clause sorts the result in descending order based on the percentage, and the result includes the day of the week and its corresponding percentage, both as columns. The percentage is multiplied by 100.0 to preserve the precision and cast as a float.

The ouput gives a ranking of the days of the week based on the volume of **'ViewCount'** as a percentage, from highest to lowest.

# Task 3: Cross Table Queries

## Lifecycle Stage: Analyze
Let's continue the analysis with our multi-table queries.

### Cross Table Queries

From the Template SQL Queries there are a series of queries requested. You are responsible for coding the result. Use the pattern above to accomplish the coding objective.  Copy and paste the question (column B Action) into a markdown cell and answer the query. Use the pattern that you have been using above. 

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter your code below.  Just keep on inserting cells as you need them.
    </font></div>

In [89]:
# How many posts have been created by a user that has a filled out the "AboutMe" section?
sql = """
SELECT COUNT(DISTINCT posts.Id) AS count
    FROM posts
        JOIN users ON posts.OwnerUserId = users.Id
            WHERE users.AboutMe IS NOT NULL
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

   count
0  17189

In [90]:
 # create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Cross Table Queries'],
              'action': ['How many posts have been created by a user that has a filled out the "AboutMe" section?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

**EXPLANATION**

This query uses a **JOIN** operation to combine the **posts** table with the users table based on the **OwnerUserId** and **Id** columns, respectively. The **WHERE** clause filters the result to only include users who have filled out the "AboutMe" section, which is indicated by a non-null value in the **AboutMe** column. The **DISTINCT** keyword with the **COUNT** function is used to count the number of distinct post IDs in the result. The result was thereafter returned as count, which represents the number of posts created by users who have filled out the "AboutMe" section.

In [92]:
# Considering only the users with an "AboutMe," how many posts are there per user?
sql = """
SELECT users.Id AS UserId, COUNT(posts.Id) AS number_of_posts
    FROM users
        INNER JOIN posts ON users.Id = posts.OwnerUserId
            WHERE users.AboutMe IS NOT NULL
                GROUP BY users.Id
                    """
result = pd.read_sql(sql, con) # con is the connection to the database
result

      UserId  number_of_posts
0         -1                1
1         22                2
2         25                4
3         29                1
4        104                1
...      ...              ...
3361  267133                1
3362  267172                1
3363  267205                1
3364  267232                1
3365  267322                1

[3366 rows x 2 columns]

In [93]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Cross Table Queries'],
              'action': ['Considering only the users with an "AboutMe," how many posts are there per user?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

**EXPLANATION**

The **INNER JOIN** clause joins the **users** table with the **posts** table using the "OwnerUserId" column as the foreign key. The **WHERE** clause filters out any users that do not have an **"AboutMe"** value. Finally the **GROUP BY** clause groups the results by Users Id so that the COUNT function can be used to count the number of posts for each user.

In [94]:
# Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?
sql = """
SELECT posts.Id, COUNT(comments.Id) AS number_of_comments
    FROM posts
        INNER JOIN comments ON posts.Id = comments.PostId
            GROUP BY posts.Id
                ORDER BY number_of_comments DESC
                    LIMIT 10
                        """
result = pd.read_sql(sql, con) # con is the connection to the database
result

       Id  number_of_comments
0  386853                  66
1  386556                  34
2  418910                  31
3  395232                  31
4  402987                  27
5  386075                  26
6  394118                  24
7  402950                  23
8  398828                  23
9  396111                  22

In [95]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Cross Table Queries'],
              'action': ['Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

**EXPLANATION**

The **INNER JOIN** clause joins the **posts** table with the **comments** table using the **"PostId"** column as the foreign key. The **GROUP BY** clause groups the results by **Id** in the posts table so that the COUNT function can be used to count the number of comments for each post. The **ORDER BY** clause sorts the results by the number of comments in descending order. While the **LIMIT** clause limits the number of results to the top 10 posts with the most comments.

In [97]:
# What are the Top 10 posts which have the highest cummulative (post score + comment score) score? 
sql = """
SELECT posts.Id, posts.score + SUM(COALESCE(comments.score, 0)) AS total_score
    FROM posts
        LEFT JOIN comments ON posts.Id = comments.PostId
            GROUP BY posts.Id
                ORDER BY total_score DESC
                    LIMIT 10
                        """
result = pd.read_sql(sql, con) # con is the connection to the database
result

       Id  total_score
0  394118          306
1  394128          169
2  388578          141
3  398653          111
4  431397          101
5  388566          101
6  398646           99
7  421677           96
8  426878           93
9  420526           92

In [98]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Cross Table Queries'],
              'action': ['What are the Top 10 posts which have the highest cummulative (post score + comment score) score?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

**EXPLANATION**

The **LEFT JOIN** clause joins the "posts" table with the "comments" table using the **"PostId"** column as the foreign key, and uses the **COALESCE** function to replace null comment scores with 0. The **GROUP BY** clause groups the results by **Id** in the posts table so that the SUM function can be used to calculate the **total score** for each post. The **ORDER BY** clause sorts the results by the total score in descending order. Thereafter, the **LIMIT** clause limits the number of results to the top 10 posts with the highest cumulative score.

In [99]:
# Who are the top 10 users who comment the most? 
sql = """
SELECT users.Id, COUNT(comments.Id) AS number_of_comments, users.reputation
    FROM users
        INNER JOIN comments ON users.Id = comments.UserId
            GROUP BY users.Id
                ORDER BY number_of_comments DESC
                    LIMIT 10
                        """
result = pd.read_sql(sql, con) # con is the connection to the database
result

       Id  number_of_comments  Reputation
0     919                3301      223056
1     805                1153      228662
2  143489                1024        2890
3   11887                 805       39200
4   85665                 691       17391
5  164061                 540       13485
6   22047                 536       41385
7  158565                 504        6482
8    7962                 492        8030
9   35989                 470       71548

In [100]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Cross Table Queries'],
              'action': ['Who are the top 10 users who comment the most?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

**EXPLANATION**

The **INNER JOIN** clause joins the **"users"** table with the **"comments"** table using the "UserId" column as the foreign key. The **GROUP BY** clause groups the results by **User Id** so that the COUNT function can be used to count the number of comments for each user. The **SELECT** clause includes the **"User Id"**, **"number_of_comments"**, and **"reputation"** fields. The **ORDER BY** clause sorts the results by the number of comments in descending order. Finally, the **LIMIT** clause limits the number of results to the top 10 users with the most comments.

In [101]:
# Who are the top 10 users who post the most? 
sql = """
SELECT users.Id, COUNT(posts.Id) AS number_of_posts, users.reputation
    FROM users
        INNER JOIN posts ON users.Id = posts.OwnerUserId
            GROUP BY users.Id
                ORDER BY users.reputation DESC
                    LIMIT 10
                        """
result = pd.read_sql(sql, con) # con is the connection to the database
result

      Id  number_of_posts  Reputation
0    805              230      228662
1    919              203      223056
2   7290               35      115531
3    686              386       85077
4  28666                8       75024
5  35989              230       71548
6   7224              233       65999
7   4253               71       59952
8   1352              285       59160
9  22311              140       51155

In [102]:
# create a dictionary with the values for the above query and insert these into the queries table
query_dict = {
              'task': ['Cross Table Queries'],
              'action': ['Who are the top 10 users who post the most?'],
              'query': [sql]
             }

# put query into the query_dict
queries = pd.DataFrame(query_dict)
    
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

1

**EXPLANATION**

The **INNER JOIN** clause joins the **"users"** table with the **"posts"** table using the **"OwnerUserId"** column as the foreign key. The **GROUP BY** clause groups the results by **User Id** so that the COUNT function can be used to count the number of posts for each user. The SELECT clause includes the **"User Id"**, **"num_posts"**, and **"reputation"** fields. The **ORDER BY** clause sorts the results by **user reputation** in descending order. Thereafter, the **LIMIT** clause limits the number of results to the top 10 users with the most posts.

# Task 4: Check the Queries Table

Now let's tidy up and check the queries table.

First let's check it's contents:

In [103]:
%sql SELECT * FROM queries

 * sqlite:///chatdata.db
Done.

[('Single Table Queries', 'Which 5 users have viewed the most times and what is the sum of those views per user?', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    '),
 ('Task 1', 'Create table comments', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    '),
 ('Task 1', 'Count the number of rows in the comments table', '\nSELECT COUNT(*) AS count\n    FROM comments\n       '),
 ('Task 1', 'Count the number of rows in the users table', '\nSELECT COUNT(*) AS count\n    FROM users\n       '),
 ('Task 1', 'Count the number of rows in the posts table', '\nSELECT COUNT(*) AS count\n    FROM posts\n       '),
 ('Task 1', 'Select 5 random rows from the comments table', '\nSELECT *\n    FROM comments\n        ORDER BY random()\n            LIMIT 5\n                '),
 ('Task 1', 'Select 5 random rows from the posts table', '\nSELECT *\n    FROM posts\n        ORDER BY random()\n            LIMIT 5\n                '),
 ('Task 1', 'Select 5 random rows from the users table', '\nSELECT *\n    FROM users\n        ORDER BY random()\n            LIMIT 5\n                '),
 ('Single Table Queries', 'How many posts have 0 comments?', '\nSELECT COUNT(*) AS count\n    FROM posts\n        WHERE CommentCount = 0\n            '),
 ('Single Table Queries', 'How many posts have 1 comments?', '\nSELECT COUNT(*) AS count\n    FROM posts\n        WHERE CommentCount = 1\n            '),
 ('Single Table Queries', 'How many posts have 2 comments or more?', '\nSELECT COUNT(*) AS count\n    FROM posts\n        WHERE CommentCount >= 2\n            '),
 ('Single Table Queries', 'Find the 5 posts with the highest viewcount', '\nSELECT ViewCount, Id\n    FROM posts\n        ORDER BY ViewCount DESC\n            LIMIT 5\n                '),
 ('Single Table Queries', 'Find the top 5 posts with the highest scores', '\nSELECT Score, Id\n    FROM posts\n        ORDER BY Score DESC\n            LIMIT 5\n                '),
 ('Single Table Queries', 'What are the 5 most frequent scores on posts?', '\nSELECT score, COUNT (*) AS count\n    FROM posts\n        GROUP BY Score \n            ORDER BY count DESC\n            LIMIT 5\n                '),
 ('Single Table Queries', 'How many posts have the keyword "data" in their tags?', '\nSELECT COUNT(*) AS count\n    FROM posts\n        WHERE Tags LIKE "%<data>%"\n            '),
 ('Single Table Queries', 'What are the 5 most frequent commentcount for posts?', '\nSELECT CommentCount, COUNT (*) AS count\n    FROM posts\n        GROUP BY CommentCount \n            ORDER BY count DESC\n            LIMIT 5\n                '),
 ('Single Table Queries', 'How many posts have an accepted answer?', '\nSELECT COUNT(*) AS count\n    FROM posts\n        WHERE AcceptedAnswerId IS NOT NULL\n            '),
 ('Single Table Queries', 'What is the average reputation of table users?', '\nSELECT AVG(Reputation) AS avg_reputation\n    FROM users\n        '),
 ('Single Table Queries', 'What are the min and max reputation of users?', '\nSELECT MIN(reputation) AS min_rep, MAX(reputation) AS max_rep\n    FROM users\n        '),
 ('Single Table Queries', 'What is the length of the body of 5 most viewed posts?', '\nSELECT LENGTH(Body) AS body_length, Id\n    FROM posts\n        ORDER BY ViewCount DESC\n            LIMIT 5\n                '),
 ('Single Table Queries', 'How many different locations are there in the users table?', '\nSELECT COUNT(DISTINCT Location) AS count\n    FROM users\n        '),
 ('Single Table Queries', 'What are the top 5 locations of users?', '\nSELECT Location, COUNT (*) AS count\n    FROM users\n        WHERE Location <> "None"\n        GROUP BY Location \n            ORDER BY count DESC\n            LIMIT 5\n                '),
 ('Single Table Queries', 'Rank the days of the week from highest to lowest in terms of the volume of ViewCount as a percentage', "\nSELECT \n\nCASE CAST(strftime('%w', CreationDate) AS INTEGER)\nWHEN 0 THEN 'Sunday'\nWHEN 1 THEN 'Monday'\nWHEN 2 THEN 'Tuesday'\nWHEN 3 THEN 'Wedn ... (153 characters truncated) ... ) FROM posts) AS viewcount_percentage\n    FROM posts\n        GROUP BY day_of_week\n            ORDER BY viewcount_percentage DESC\n                "),
 ('Cross Table Queries', 'How many posts have been created by a user that has a filled out the "AboutMe" section?', '\nSELECT COUNT(DISTINCT posts.Id) AS count\n    FROM posts\n        JOIN users ON posts.OwnerUserId = users.Id\n            WHERE users.AboutMe IS NOT NULL\n                '),
 ('Cross Table Queries', 'Considering only the users with an "AboutMe," how many posts are there per user?', '\nSELECT users.Id AS UserId, COUNT(posts.Id) AS number_of_posts\n    FROM users\n        INNER JOIN posts ON users.Id = posts.OwnerUserId\n            WHERE users.AboutMe IS NOT NULL\n                GROUP BY users.Id\n                    '),
 ('Cross Table Queries', 'Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?', '\nSELECT posts.Id, COUNT(comments.Id) AS number_of_comments\n    FROM posts\n        INNER JOIN comments ON posts.Id = comments.PostId\n            GROUP BY posts.Id\n                ORDER BY number_of_comments DESC\n                    LIMIT 10\n                        '),
 ('Cross Table Queries', 'What are the Top 10 posts which have the highest cummulative (post score + comment score) score?', '\nSELECT posts.Id, posts.score + SUM(COALESCE(comments.score, 0)) AS total_score\n    FROM posts\n        LEFT JOIN comments ON posts.Id = comments.PostId\n            GROUP BY posts.Id\n                ORDER BY total_score DESC\n                    LIMIT 10\n                        '),
 ('Cross Table Queries', 'Who are the top 10 users who comment the most?', '\nSELECT users.Id, COUNT(comments.Id) AS number_of_comments, users.reputation\n    FROM users\n        INNER JOIN comments ON users.Id = comments.UserId\n            GROUP BY users.Id\n                ORDER BY number_of_comments DESC\n                    LIMIT 10\n                        '),
 ('Cross Table Queries', 'Who are the top 10 users who post the most?', '\nSELECT users.Id, COUNT(posts.Id) AS number_of_posts, users.reputation\n    FROM users\n        INNER JOIN posts ON users.Id = posts.OwnerUserId\n            GROUP BY users.Id\n                ORDER BY users.reputation DESC\n                    LIMIT 10\n                        ')]

## Drop Duplicates

You likely have some duplicates. Lets drop them.

In [104]:
# Read the queries table into pandas
sql = 'SELECT * FROM queries'
queries = pd.read_sql(sql, con)

# Drop duplicates
queries.drop_duplicates(inplace = True) # drop duplicates

## Case Issues

Remember, SQL is case insensitive. Pandas IS case sensitive. Lets deal with this now by making all of the text uppercase.

In [105]:
for col in queries.columns:
    queries[col] = queries[col].str.upper()
    
queries

,task,action,query
0,SINGLE TABLE QUERIES,WHICH 5 USERS HAVE VIEWED THE MOST TIMES AND W...,"\n CREATE TABLE ""COMMENTS"" (\n ""ID"" INTE..."
1,TASK 1,CREATE TABLE COMMENTS,"\n CREATE TABLE ""COMMENTS"" (\n ""ID"" INTE..."
2,TASK 1,COUNT THE NUMBER OF ROWS IN THE COMMENTS TABLE,\nSELECT COUNT(*) AS COUNT\n FROM COMMENTS\...
3,TASK 1,COUNT THE NUMBER OF ROWS IN THE USERS TABLE,\nSELECT COUNT(*) AS COUNT\n FROM USERS\n ...
4,TASK 1,COUNT THE NUMBER OF ROWS IN THE POSTS TABLE,\nSELECT COUNT(*) AS COUNT\n FROM POSTS\n ...
5,TASK 1,SELECT 5 RANDOM ROWS FROM THE COMMENTS TABLE,\nSELECT *\n FROM COMMENTS\n ORDER B...
6,TASK 1,SELECT 5 RANDOM ROWS FROM THE POSTS TABLE,\nSELECT *\n FROM POSTS\n ORDER BY R...
7,TASK 1,SELECT 5 RANDOM ROWS FROM THE USERS TABLE,\nSELECT *\n FROM USERS\n ORDER BY R...
8,SINGLE TABLE QUERIES,HOW MANY POSTS HAVE 0 COMMENTS?,\nSELECT COUNT(*) AS COUNT\n FROM POSTS\n ...
9,SINGLE TABLE QUERIES,HOW MANY POSTS HAVE 1 COMMENTS?,\nSELECT COUNT(*) AS COUNT\n FROM POSTS\n ...
10,SINGLE TABLE QUERIES,HOW MANY POSTS HAVE 2 COMMENTS OR MORE?,\nSELECT COUNT(*) AS COUNT\n FROM POSTS\n ...
11,SINGLE TABLE QUERIES,FIND THE 5 POSTS WITH THE HIGHEST VIEWCOUNT,"\nSELECT VIEWCOUNT, ID\n FROM POSTS\n ..."
12,SINGLE TABLE QUERIES,FIND THE TOP 5 POSTS WITH THE HIGHEST SCORES,"\nSELECT SCORE, ID\n FROM POSTS\n OR..."
13,SINGLE TABLE QUERIES,WHAT ARE THE 5 MOST FREQUENT SCORES ON POSTS?,"\nSELECT SCORE, COUNT (*) AS COUNT\n FROM P..."
14,SINGLE TABLE QUERIES,"HOW MANY POSTS HAVE THE KEYWORD ""DATA"" IN THEI...",\nSELECT COUNT(*) AS COUNT\n FROM POSTS\n ...
15,SINGLE TABLE QUERIES,WHAT ARE THE 5 MOST FREQUENT COMMENTCOUNT FOR ...,"\nSELECT COMMENTCOUNT, COUNT (*) AS COUNT\n ..."
16,SINGLE TABLE QUERIES,HOW MANY POSTS HAVE AN ACCEPTED ANSWER?,\nSELECT COUNT(*) AS COUNT\n FROM POSTS\n ...
17,SINGLE TABLE QUERIES,WHAT IS THE AVERAGE REPUTATION OF TABLE USERS?,\nSELECT AVG(REPUTATION) AS AVG_REPUTATION\n ...
18,SINGLE TABLE QUERIES,WHAT ARE THE MIN AND MAX REPUTATION OF USERS?,"\nSELECT MIN(REPUTATION) AS MIN_REP, MAX(REPUT..."
19,SINGLE TABLE QUERIES,WHAT IS THE LENGTH OF THE BODY OF 5 MOST VIEWE...,"\nSELECT LENGTH(BODY) AS BODY_LENGTH, ID\n ..."
20,SINGLE TABLE QUERIES,HOW MANY DIFFERENT LOCATIONS ARE THERE IN THE ...,\nSELECT COUNT(DISTINCT LOCATION) AS COUNT\n ...
21,SINGLE TABLE QUERIES,WHAT ARE THE TOP 5 LOCATIONS OF USERS?,"\nSELECT LOCATION, COUNT (*) AS COUNT\n FRO..."
22,SINGLE TABLE QUERIES,RANK THE DAYS OF THE WEEK FROM HIGHEST TO LOWE...,"\nSELECT \n\nCASE CAST(STRFTIME('%W', CREATION..."
23,CROSS TABLE QUERIES,HOW MANY POSTS HAVE BEEN CREATED BY A USER THA...,\nSELECT COUNT(DISTINCT POSTS.ID) AS COUNT\n ...
24,CROSS TABLE QUERIES,"CONSIDERING ONLY THE USERS WITH AN ""ABOUTME,"" ...","\nSELECT USERS.ID AS USERID, COUNT(POSTS.ID) A..."
25,CROSS TABLE QUERIES,NOT TAKING INTO ACCOUNT THE COMMENTCOUNT FIELD...,"\nSELECT POSTS.ID, COUNT(COMMENTS.ID) AS NUMBE..."
26,CROSS TABLE QUERIES,WHAT ARE THE TOP 10 POSTS WHICH HAVE THE HIGHE...,"\nSELECT POSTS.ID, POSTS.SCORE + SUM(COALESCE(..."
27,CROSS TABLE QUERIES,WHO ARE THE TOP 10 USERS WHO COMMENT THE MOST?,"\nSELECT USERS.ID, COUNT(COMMENTS.ID) AS NUMBE..."
28,CROSS TABLE QUERIES,WHO ARE THE TOP 10 USERS WHO POST THE MOST?,"\nSELECT USERS.ID, COUNT(POSTS.ID) AS NUMBER_O..."

In [108]:
# Write the now deduped uppercase dataframe back to sqlite and replace the table
queries.to_sql('queries', con, if_exists='replace', index=False)

29

## Use Case

Now that we have this queries table, lets give you some ideas about how you would use it.

Suppose you wanted to find all of the queries where you did a GROUP BY:

In [109]:
%%sql
SELECT query
    FROM queries
        WHERE query LIKE '%GROUP BY%'

 * sqlite:///chatdata.db
Done.

[('\nSELECT SCORE, COUNT (*) AS COUNT\n    FROM POSTS\n        GROUP BY SCORE \n            ORDER BY COUNT DESC\n            LIMIT 5\n                ',),
 ('\nSELECT COMMENTCOUNT, COUNT (*) AS COUNT\n    FROM POSTS\n        GROUP BY COMMENTCOUNT \n            ORDER BY COUNT DESC\n            LIMIT 5\n                ',),
 ('\nSELECT LOCATION, COUNT (*) AS COUNT\n    FROM USERS\n        WHERE LOCATION <> "NONE"\n        GROUP BY LOCATION \n            ORDER BY COUNT DESC\n            LIMIT 5\n                ',),
 ("\nSELECT \n\nCASE CAST(STRFTIME('%W', CREATIONDATE) AS INTEGER)\nWHEN 0 THEN 'SUNDAY'\nWHEN 1 THEN 'MONDAY'\nWHEN 2 THEN 'TUESDAY'\nWHEN 3 THEN 'WEDN ... (153 characters truncated) ... ) FROM POSTS) AS VIEWCOUNT_PERCENTAGE\n    FROM POSTS\n        GROUP BY DAY_OF_WEEK\n            ORDER BY VIEWCOUNT_PERCENTAGE DESC\n                ",),
 ('\nSELECT USERS.ID AS USERID, COUNT(POSTS.ID) AS NUMBER_OF_POSTS\n    FROM USERS\n        INNER JOIN POSTS ON USERS.ID = POSTS.OWNERUSERID\n            WHERE USERS.ABOUTME IS NOT NULL\n                GROUP BY USERS.ID\n                    ',),
 ('\nSELECT POSTS.ID, COUNT(COMMENTS.ID) AS NUMBER_OF_COMMENTS\n    FROM POSTS\n        INNER JOIN COMMENTS ON POSTS.ID = COMMENTS.POSTID\n            GROUP BY POSTS.ID\n                ORDER BY NUMBER_OF_COMMENTS DESC\n                    LIMIT 10\n                        ',),
 ('\nSELECT POSTS.ID, POSTS.SCORE + SUM(COALESCE(COMMENTS.SCORE, 0)) AS TOTAL_SCORE\n    FROM POSTS\n        LEFT JOIN COMMENTS ON POSTS.ID = COMMENTS.POSTID\n            GROUP BY POSTS.ID\n                ORDER BY TOTAL_SCORE DESC\n                    LIMIT 10\n                        ',),
 ('\nSELECT USERS.ID, COUNT(COMMENTS.ID) AS NUMBER_OF_COMMENTS, USERS.REPUTATION\n    FROM USERS\n        INNER JOIN COMMENTS ON USERS.ID = COMMENTS.USERID\n            GROUP BY USERS.ID\n                ORDER BY NUMBER_OF_COMMENTS DESC\n                    LIMIT 10\n                        ',),
 ('\nSELECT USERS.ID, COUNT(POSTS.ID) AS NUMBER_OF_POSTS, USERS.REPUTATION\n    FROM USERS\n        INNER JOIN POSTS ON USERS.ID = POSTS.OWNERUSERID\n            GROUP BY USERS.ID\n                ORDER BY USERS.REPUTATION DESC\n                    LIMIT 10\n                        ',)]

## Now Your Turn
Find the queries that have 'DISTINCT' in them. You can do it with the %sql command or with Pandas and sql.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

#Find queries that have 'DISTINCT' in them

In [118]:
%%sql
SELECT query
    FROM queries
        WHERE query LIKE '%DISTINCT%'

 * sqlite:///chatdata.db
Done.

[('\nSELECT COUNT(DISTINCT LOCATION) AS COUNT\n    FROM USERS\n        ',),
 ('\nSELECT COUNT(DISTINCT POSTS.ID) AS COUNT\n    FROM POSTS\n        JOIN USERS ON POSTS.OWNERUSERID = USERS.ID\n            WHERE USERS.ABOUTME IS NOT NULL\n                ',)]

# Close SQLite

It is good practise to close all relational databases as soon as you are finished updating them.

In [ ]:
con.close()

# All Done!

Great job. You now have a good idea for how to use sql and pandas with sql. You can create your own databases from csv files and you can do extensive querying using sql. These are valuable skills that will take you a long ways in todays technological world.

**COMPLETED BY SEBASTIAN NNOROM: Junior Data Analyst**